In [1]:
import pandas

In [2]:
RDSpend=[35,56,32,89,23,22,45,34,12]
Adminstration = [98,76,53,34,12,12,657,88,67]
MarketingSpend = [98,56,98,45,53,52,44,34,35]
State = ['Spain', 'South Korea','New York','Califonia','South Korea','Spain','Georgia','India','Rome']
Profit = [123,457,788,546,456,324,467,878,345]

In [3]:
tabl = {'RDSpend:' :RDSpend, 'Adminstration: ' :Adminstration, 'Marketing_Spend: ' :MarketingSpend, 'State:' :State, 'Profit: ' :Profit}

In [4]:
tabl

{'RDSpend:': [35, 56, 32, 89, 23, 22, 45, 34, 12],
 'Adminstration: ': [98, 76, 53, 34, 12, 12, 657, 88, 67],
 'Marketing_Spend: ': [98, 56, 98, 45, 53, 52, 44, 34, 35],
 'State:': ['Spain',
  'South Korea',
  'New York',
  'Califonia',
  'South Korea',
  'Spain',
  'Georgia',
  'India',
  'Rome'],
 'Profit: ': [123, 457, 788, 546, 456, 324, 467, 878, 345]}

In [8]:
tabl = pandas.DataFrame(tabl)

In [15]:
tabl.tail(5)

   RDSpend:  Adminstration:   Marketing_Spend:        State:  Profit:
4        23               12                 53  South Korea       456
5        22               12                 52        Spain       324
6        45              657                 44      Georgia       467
7        34               88                 34        India       878
8        12               67                 35         Rome       345

In [10]:
tabl.head(5)

   RDSpend:  Adminstration:   Marketing_Spend:        State:  Profit:
0        35               98                 98        Spain       123
1        56               76                 56  South Korea       457
2        32               53                 98     New York       788
3        89               34                 45    Califonia       546
4        23               12                 53  South Korea       456

In [11]:
tabl

   RDSpend:  Adminstration:   Marketing_Spend:        State:  Profit:
0        35               98                 98        Spain       123
1        56               76                 56  South Korea       457
2        32               53                 98     New York       788
3        89               34                 45    Califonia       546
4        23               12                 53  South Korea       456
5        22               12                 52        Spain       324
6        45              657                 44      Georgia       467
7        34               88                 34        India       878
8        12               67                 35         Rome       345

In [16]:
tabl.columns

Index(['RDSpend:', 'Adminstration: ', 'Marketing_Spend: ', 'State:',
       'Profit: '],
      dtype='object')

In [17]:
tabl.to_excel('tabl.xlsx')